BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny202.PIC
        <edc:SFRDef edc:_addr="0x1001" edc:access="------nn" edc:cname="CTRLB" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="APCWP" edc:desc="Application code write protect" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOOTLOCK" edc:desc="Boot Lock" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1002" edc:access="-----rrr" edc:cname="STATUS" edc:impl="0x7" edc:nzwidth="0x8" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="FBUSY" edc:desc="Flash busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEBUSY" edc:desc="EEPROM busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRERROR" edc:desc="Write error" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1003" edc:access="-------n" edc:cname="INTCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="EEREADY" edc:desc="EEPROM Ready" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1004" edc:access="-------n" edc:cname="INTFLAGS" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="EEREADY" edc:desc="EEPROM Ready" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x1005" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x1006" edc:access="nnnnnnnnnnnnnnnn" edc:cname="DATA" edc:nzwidth="0x10" ltx:memberofperipheral="NVMCTRL"/>
        <edc:SFRDef edc:_addr="0x1008" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADDR" edc:nzwidth="0x10" ltx:memberofperipheral="NVMCTRL"/>
      </edc:SFRDataSector>
      <edc:ConfigFuseSector atdf:pagesize="0x20" edc:beginaddr="0x128A" edc:endaddr="0x128B" edc:magicoffset="0x830000" edc:regionid="LOCKBITS">
        <edc:DCRDef edc:_addr="0x128A" edc:access="nnnnnnnn" edc:cname="LOCKBIT" edc:factorydefault="0xC5" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="LOCKBIT">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCKBIT">
              <edc:DCRFieldDef edc:cname="LB" edc:desc="Lock Bits" edc:nzwidth="0x8">
                <edc:DCRFieldSemantic edc:cname="RWLOCK" edc:desc="Read and write lock" edc:when="(field &amp; 0xFF) == 0x3A"/>
                <edc:DCRFieldSemantic edc:cname="NOLOCK" edc:desc="No locks" edc:when="(field &amp; 0xFF) == 0xC5"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
      </edc:ConfigFuseSector>
      <edc:SFRDataSector atdf:pagesize="0x40" edc:beginaddr="0x8000" edc:endaddr="0x8800" edc:regionid="MAPPED_PROGMEM"/>
      <edc:DeviceIDSector atdf:pagesize="0x40" edc:beginaddr="0x1103" edc:endaddr="0x1140" edc:regionid="PROD_SIGNATURES" edc:value="0x1E9123">
        <edc:DCRDef edc:_addr="0x1103" edc:access="rrrrrrrr" edc:cname="SERNUM0" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1104" edc:access="rrrrrrrr" edc:cname="SERNUM1" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1105" edc:access="rrrrrrrr" edc:cname="SERNUM2" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1106" edc:access="rrrrrrrr" edc:cname="SERNUM3" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1107" edc:access="rrrrrrrr" edc:cname="SERNUM4" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1108" edc:access="rrrrrrrr" edc:cname="SERNUM5" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1109" edc:access="rrrrrrrr" edc:cname="SERNUM6" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x110A" edc:access="rrrrrrrr" edc:cname="SERNUM7" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x110B" edc:access="rrrrrrrr" edc:cname="SERNUM8" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x110C" edc:access="rrrrrrrr" edc:cname="SERNUM9" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:AdjustPoint edc:_addr="0x110D" edc:offset="0x13"/>
        <edc:DCRDef edc:_addr="0x1120" edc:access="rrrrrrrr" edc:cname="TEMPSENSE0" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1121" edc:access="rrrrrrrr" edc:cname="TEMPSENSE1" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1122" edc:access="rrrrrrrr" edc:cname="OSC16ERR3V" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1123" edc:access="rrrrrrrr" edc:cname="OSC16ERR5V" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1124" edc:access="rrrrrrrr" edc:cname="OSC20ERR3V" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1125" edc:access="rrrrrrrr" edc:cname="OSC20ERR5V" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
      </edc:DeviceIDSector>
      <edc:DeviceIDSector atdf:pagesize="0x40" edc:beginaddr="0x1100" edc:endaddr="0x1103" edc:regionid="SIGNATURES" edc:value="0x1E9123">
        <edc:DCRDef edc:_addr="0x1100" edc:access="rrrrrrrr" edc:cname="DEVICEID0" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1101" edc:access="rrrrrrrr" edc:cname="DEVICEID1" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1102" edc:access="rrrrrrrr" edc:cname="DEVICEID2" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
      </edc:DeviceIDSector>
    </edc:RegardlessOfMode>
  </edc:DataSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6"/>
      <edc:VirtualPin edc:name="AIN6" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVAPA6" edc:ppsfunction="EVAINCH0"/>
      <edc:VirtualPin edc:name="EVSPA6" edc:ppsfunction="EVSINCH0"/>
      <edc:VirtualPin edc:name="LUT1_OUT0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI0_ALT"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART0"/>
      <edc:VirtualPin edc:name="WOB0" edc:ppsfunction="TCB0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7"/>
      <edc:VirtualPin edc:name="AIN7" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVAPA7" edc:ppsfunction="EVAINCH0"/>
      <edc:VirtualPin edc:name="EVSPA7" edc:ppsfunction="EVSINCH0"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI0_ALT"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART0"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVAPA2" edc:ppsfunction="EVAINCH0"/>
      <edc:VirtualPin edc:name="EVOUT0" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="EVSPA2" edc:ppsfunction="EVSINCH0"/>
      <edc:VirtualPin edc:name="LUT0_IN2" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI0"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART0_ALT"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="TWI0"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="BREAK" edc:ppsfunction="OTHER"/>
      <edc:VirtualPin edc:name="EVAPA1" edc:ppsfunction="EVAINCH0"/>
      <edc:VirtualPin edc:name="EVSPA1" edc:ppsfunction="EVSINCH0"/>
      <edc:VirtualPin edc:name="LUT0_IN1" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI0"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="TWI0"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART0_ALT"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVAPA0" edc:ppsfunction="EVAINCH0"/>
      <edc:VirtualPin edc:name="EVSPA0" edc:ppsfunction="EVSINCH0"/>
      <edc:VirtualPin edc:name="LUT0_IN0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RESET" edc:ppsfunction="OTHER"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI0"/>
      <edc:VirtualPin edc:name="UPDI" edc:ppsfunction="OTHER"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="CLKI" edc:ppsfunction="CLKCTRL"/>
      <edc:VirtualPin edc:name="EVAPA3" edc:ppsfunction="EVAINCH0"/>
      <edc:VirtualPin edc:name="EVSPA3" edc:ppsfunction="EVSINCH0"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI0"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>